#+TITLE: JavaScript Async/Await, Promises, Fetch and REST API
#+DATE:<2025-05-16 Fri>

** 2. Async/Await
#+BEGIN_SRC js :results output
async function someWork(ms) {
    return new Promise(resolve => setTimeout(resolve, ms))
}

async function asyncTasksExecution(){
    console.log('first call to backend:')
    await someWork(2000);

    console.log('second call to backend:')
    await someWork(1000);

    console.log('third call to backend:')
    await someWork(1000);
}

asyncTasksExecution();
#+END_SRC

#+RESULTS:
first call to backend:
second call to backend:
third call to backend:

